from matplotlib import pyplot as plt

plt.rcParams['font.sans-serif'] = ['SimHei']

x = ['长津湖', '战狼2', '你好，李焕英', '哪吒之魔童降世', '流浪地球', '唐人街探案3', '复仇者联盟4：终局之战', '长津湖之水门桥', '红海行动', '唐人街探案2', '美人鱼', '我和我的祖国',
     '八佰', '我不是药神', '中国机长', '我和我的家乡', '速度与激情8', '这个杀手不太冷静', '西虹市首富', '捉妖记', '速度与激情7', '复仇者联盟3：无限战争', '捉妖记2', '羞羞的铁拳',
     '疯狂的外星人', '独行月球', '海王', '变形金刚4：绝迹重生', '前任3：再见前任', '毒液：致命守护者']
y = [577523, 569454, 541308, 503570, 468674, 452341, 425013, 406648, 365200, 339777, 339120, 316992, 311076, 310002,
     291294, 282982, 267093, 262795, 254766, 243623, 242313, 239051, 223723, 221365, 221321, 212258, 201307, 197652,
     194190, 187065]

# 设置图片大小
plt.figure(figsize=(16, 8), dpi=100)

# 绘制条形图
plt.barh(range(len(x)), y, height=0.3,color='orange')
plt.yticks(range(len(x)), x, )

plt.title('电影票房统计图')
plt.ylabel('影片名')
plt.xlabel('人民币 (万)')
# 绘制网格
plt.grid(alpha=0.3)
# 展示
plt.show()
